zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131axx_ca7.h
/**************  Bit definition for ETH_MACIVIR register  **************/
#define ETH_MACIVIR_VLT_Pos                 (0U)
#define ETH_MACIVIR_VLT_Msk                 (0xFFFFUL << ETH_MACIVIR_VLT_Pos)                    /*!< 0x0000FFFF */
#define ETH_MACIVIR_VLT                     ETH_MACIVIR_VLT_Msk                                 /*!< VLAN Tag for Transmit Packets */
#define ETH_MACIVIR_VLT_0                   (0x1UL << ETH_MACIVIR_VLT_Pos)                       /*!< 0x00000001 */
#define ETH_MACIVIR_VLT_1                   (0x2UL << ETH_MACIVIR_VLT_Pos)                       /*!< 0x00000002 */
#define ETH_MACIVIR_VLT_2                   (0x4UL << ETH_MACIVIR_VLT_Pos)                       /*!< 0x00000004 */
#define ETH_MACIVIR_VLT_3                   (0x8UL << ETH_MACIVIR_VLT_Pos)                       /*!< 0x00000008 */
#define ETH_MACIVIR_VLT_4                   (0x10UL << ETH_MACIVIR_VLT_Pos)                      /*!< 0x00000010 */
#define ETH_MACIVIR_VLT_5                   (0x20UL << ETH_MACIVIR_VLT_Pos)                      /*!< 0x00000020 */
#define ETH_MACIVIR_VLT_6                   (0x40UL << ETH_MACIVIR_VLT_Pos)                      /*!< 0x00000040 */
#define ETH_MACIVIR_VLT_7                   (0x80UL << ETH_MACIVIR_VLT_Pos)                      /*!< 0x00000080 */
#define ETH_MACIVIR_VLT_8                   (0x100UL << ETH_MACIVIR_VLT_Pos)                     /*!< 0x00000100 */
#define ETH_MACIVIR_VLT_9                   (0x200UL << ETH_MACIVIR_VLT_Pos)                     /*!< 0x00000200 */
#define ETH_MACIVIR_VLT_10                  (0x400UL << ETH_MACIVIR_VLT_Pos)                     /*!< 0x00000400 */
#define ETH_MACIVIR_VLT_11                  (0x800UL << ETH_MACIVIR_VLT_Pos)                     /*!< 0x00000800 */
#define ETH_MACIVIR_VLT_12                  (0x1000UL << ETH_MACIVIR_VLT_Pos)                    /*!< 0x00001000 */
#define ETH_MACIVIR_VLT_13                  (0x2000UL << ETH_MACIVIR_VLT_Pos)                    /*!< 0x00002000 */
#define ETH_MACIVIR_VLT_14                  (0x4000UL << ETH_MACIVIR_VLT_Pos)                    /*!< 0x00004000 */
#define ETH_MACIVIR_VLT_15                  (0x8000UL << ETH_MACIVIR_VLT_Pos)                    /*!< 0x00008000 */
#define ETH_MACIVIR_VLC_Pos                 (16U)
#define ETH_MACIVIR_VLC_Msk                 (0x3UL << ETH_MACIVIR_VLC_Pos)                       /*!< 0x00030000 */
#define ETH_MACIVIR_VLC                     ETH_MACIVIR_VLC_Msk                                 /*!< VLAN Tag Control in Transmit Packets */
#define ETH_MACIVIR_VLC_0                   (0x1UL << ETH_MACIVIR_VLC_Pos)                   /*!< 0x00010000 */
#define ETH_MACIVIR_VLC_1                   (0x2UL << ETH_MACIVIR_VLC_Pos)                   /*!< 0x00020000 */
#define ETH_MACIVIR_VLP_Pos                 (18U)
#define ETH_MACIVIR_VLP_Msk                 (0x1UL << ETH_MACIVIR_VLP_Pos)                       /*!< 0x00040000 */
#define ETH_MACIVIR_VLP                     ETH_MACIVIR_VLP_Msk                                 /*!< VLAN Priority Control */
#define ETH_MACIVIR_CSVL_Pos                (19U)
#define ETH_MACIVIR_CSVL_Msk                (0x1UL << ETH_MACIVIR_CSVL_Pos)                      /*!< 0x00080000 */
#define ETH_MACIVIR_CSVL                    ETH_MACIVIR_CSVL_Msk                                /*!< C-VLAN or S-VLAN */
#define ETH_MACIVIR_VLTI_Pos                (20U)
#define ETH_MACIVIR_VLTI_Msk                (0x1UL << ETH_MACIVIR_VLTI_Pos)                      /*!< 0x00100000 */
#define ETH_MACIVIR_VLTI                    ETH_MACIVIR_VLTI_Msk                                /*!< VLAN Tag Input */

/************  Bit definition for ETH_MACQ0TXFCR register  *************/
#define ETH_MACQ0TXFCR_FCB_BPA_Pos          (0U)
#define ETH_MACQ0TXFCR_FCB_BPA_Msk          (0x1UL << ETH_MACQ0TXFCR_FCB_BPA_Pos)                /*!< 0x00000001 */
#define ETH_MACQ0TXFCR_FCB_BPA              ETH_MACQ0TXFCR_FCB_BPA_Msk                          /*!< Flow Control Busy or Backpressure Activate */
#define ETH_MACQ0TXFCR_TFE_Pos              (1U)
#define ETH_MACQ0TXFCR_TFE_Msk              (0x1UL << ETH_MACQ0TXFCR_TFE_Pos)                    /*!< 0x00000002 */
#define ETH_MACQ0TXFCR_TFE                  ETH_MACQ0TXFCR_TFE_Msk                              /*!< Transmit Flow Control Enable */
#define ETH_MACQ0TXFCR_PLT_Pos              (4U)
#define ETH_MACQ0TXFCR_PLT_Msk              (0x7UL << ETH_MACQ0TXFCR_PLT_Pos)                    /*!< 0x00000070 */
#define ETH_MACQ0TXFCR_PLT                  ETH_MACQ0TXFCR_PLT_Msk                              /*!< Pause Low Threshold */
#define ETH_MACQ0TXFCR_PLT_MINUS4           (0x0UL << ETH_MACQ0TXFCR_PLT_Pos)                   /*!< 0x00000000 */
#define ETH_MACQ0TXFCR_PLT_MINUS28          (0x1UL << ETH_MACQ0TXFCR_PLT_Pos)                   /*!< 0x00000010 */
#define ETH_MACQ0TXFCR_PLT_MINUS36          (0x2UL << ETH_MACQ0TXFCR_PLT_Pos)                   /*!< 0x00000020 */
#define ETH_MACQ0TXFCR_PLT_MINUS144         (0x3UL << ETH_MACQ0TXFCR_PLT_Pos)                   /*!< 0x00000030 */
#define ETH_MACQ0TXFCR_PLT_MINUS256         (0x4UL << ETH_MACQ0TXFCR_PLT_Pos)                   /*!< 0x00000040 */
#define ETH_MACQ0TXFCR_PLT_MINUS512         (0x5UL << ETH_MACQ0TXFCR_PLT_Pos)                   /*!< 0x00000050 */
#define ETH_MACQ0TXFCR_DZPQ_Pos             (7U)
#define ETH_MACQ0TXFCR_DZPQ_Msk             (0x1UL << ETH_MACQ0TXFCR_DZPQ_Pos)                   /*!< 0x00000080 */
#define ETH_MACQ0TXFCR_DZPQ                 ETH_MACQ0TXFCR_DZPQ_Msk                             /*!< Disable Zero-Quanta Pause */
#define ETH_MACQ0TXFCR_PT_Pos               (16U)
#define ETH_MACQ0TXFCR_PT_Msk               (0xFFFFUL << ETH_MACQ0TXFCR_PT_Pos)                  /*!< 0xFFFF0000 */
#define ETH_MACQ0TXFCR_PT                   ETH_MACQ0TXFCR_PT_Msk                               /*!< Pause Time */
#define ETH_MACQ0TXFCR_PT_0                 (0x1UL << ETH_MACQ0TXFCR_PT_Pos)                 /*!< 0x00010000 */
#define ETH_MACQ0TXFCR_PT_1                 (0x2UL << ETH_MACQ0TXFCR_PT_Pos)                 /*!< 0x00020000 */
#define ETH_MACQ0TXFCR_PT_2                 (0x4UL << ETH_MACQ0TXFCR_PT_Pos)                 /*!< 0x00040000 */
#define ETH_MACQ0TXFCR_PT_3                 (0x8UL << ETH_MACQ0TXFCR_PT_Pos)                 /*!< 0x00080000 */
#define ETH_MACQ0TXFCR_PT_4                 (0x10UL << ETH_MACQ0TXFCR_PT_Pos)                /*!< 0x00100000 */
#define ETH_MACQ0TXFCR_PT_5                 (0x20UL << ETH_MACQ0TXFCR_PT_Pos)                /*!< 0x00200000 */
#define ETH_MACQ0TXFCR_PT_6                 (0x40UL << ETH_MACQ0TXFCR_PT_Pos)                /*!< 0x00400000 */
#define ETH_MACQ0TXFCR_PT_7                 (0x80UL << ETH_MACQ0TXFCR_PT_Pos)                /*!< 0x00800000 */
#define ETH_MACQ0TXFCR_PT_8                 (0x100UL << ETH_MACQ0TXFCR_PT_Pos)               /*!< 0x01000000 */
#define ETH_MACQ0TXFCR_PT_9                 (0x200UL << ETH_MACQ0TXFCR_PT_Pos)               /*!< 0x02000000 */
#define ETH_MACQ0TXFCR_PT_10                (0x400UL << ETH_MACQ0TXFCR_PT_Pos)               /*!< 0x04000000 */
#define ETH_MACQ0TXFCR_PT_11                (0x800UL << ETH_MACQ0TXFCR_PT_Pos)               /*!< 0x08000000 */
#define ETH_MACQ0TXFCR_PT_12                (0x1000UL << ETH_MACQ0TXFCR_PT_Pos)              /*!< 0x10000000 */
#define ETH_MACQ0TXFCR_PT_13                (0x2000UL << ETH_MACQ0TXFCR_PT_Pos)              /*!< 0x20000000 */
#define ETH_MACQ0TXFCR_PT_14                (0x4000UL << ETH_MACQ0TXFCR_PT_Pos)              /*!< 0x40000000 */
#define ETH_MACQ0TXFCR_PT_15                (0x8000UL << ETH_MACQ0TXFCR_PT_Pos)              /*!< 0x80000000 */

