zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131axx_ca7.h
/***************  Bit definition for FMC_BCHDSR4 register  ****************/
#define FMC_BCHDSR4_EBP7_Pos          (0U)
#define FMC_BCHDSR4_EBP7_Msk          (0x1FFFU << FMC_BCHDSR4_EBP7_Pos)      /*!< 0x00001FFF */
#define FMC_BCHDSR4_EBP7              FMC_BCHDSR4_EBP7_Msk                   /*!< Error bit position for error number 7 */
#define FMC_BCHDSR4_EBP8_Pos          (16U)
#define FMC_BCHDSR4_EBP8_Msk          (0x1FFFU << FMC_BCHDSR4_EBP8_Pos)      /*!< 0x1FFF0000 */
#define FMC_BCHDSR4_EBP8              FMC_BCHDSR4_EBP8_Msk                   /*!< Error bit position for error number 8 */

/***************  Bit definition for FMC_HWCFGR2 register  ****************/
#define FMC_HWCFGR2_RD_LN2DPTH_Pos    (0U)
#define FMC_HWCFGR2_RD_LN2DPTH_Msk    (0xFU << FMC_HWCFGR2_RD_LN2DPTH_Pos)   /*!< 0x0000000F */
#define FMC_HWCFGR2_RD_LN2DPTH        FMC_HWCFGR2_RD_LN2DPTH_Msk             /*!< AXI read data FIFO depth */
#define FMC_HWCFGR2_NOR_BASE_Pos      (4U)
#define FMC_HWCFGR2_NOR_BASE_Msk      (0xFU << FMC_HWCFGR2_NOR_BASE_Pos)     /*!< 0x000000F0 */
#define FMC_HWCFGR2_NOR_BASE          FMC_HWCFGR2_NOR_BASE_Msk               /*!< NOR base address */
#define FMC_HWCFGR2_SDRAM_RBASE_Pos   (8U)
#define FMC_HWCFGR2_SDRAM_RBASE_Msk   (0xFU << FMC_HWCFGR2_SDRAM_RBASE_Pos)  /*!< 0x00000F00 */
#define FMC_HWCFGR2_SDRAM_RBASE       FMC_HWCFGR2_SDRAM_RBASE_Msk            /*!< SDRAM remap base address */
#define FMC_HWCFGR2_NAND_BASE_Pos     (12U)
#define FMC_HWCFGR2_NAND_BASE_Msk     (0xFU << FMC_HWCFGR2_NAND_BASE_Pos)    /*!< 0x0000F000 */
#define FMC_HWCFGR2_NAND_BASE         FMC_HWCFGR2_NAND_BASE_Msk              /*!< NAND base address */
#define FMC_HWCFGR2_SDRAM1_BASE_Pos   (16U)
#define FMC_HWCFGR2_SDRAM1_BASE_Msk   (0xFU << FMC_HWCFGR2_SDRAM1_BASE_Pos)  /*!< 0x000F0000 */
#define FMC_HWCFGR2_SDRAM1_BASE       FMC_HWCFGR2_SDRAM1_BASE_Msk            /*!< SDRAM Bank1 base address */
#define FMC_HWCFGR2_SDRAM2_BASE_Pos   (20U)
#define FMC_HWCFGR2_SDRAM2_BASE_Msk   (0xFU << FMC_HWCFGR2_SDRAM2_BASE_Pos)  /*!< 0x00F00000 */
#define FMC_HWCFGR2_SDRAM2_BASE       FMC_HWCFGR2_SDRAM2_BASE_Msk            /*!< SDRAM Bank2 base address */
#define FMC_HWCFGR2_TRUSTZONE_Pos     (24U)
#define FMC_HWCFGR2_TRUSTZONE_Msk     (0x1U << FMC_HWCFGR2_TRUSTZONE_Pos)    /*!< 0x01000000 */
#define FMC_HWCFGR2_TRUSTZONE         FMC_HWCFGR2_TRUSTZONE_Msk              /*!< Support for TrustZone */
#define FMC_HWCFGR2_MAX_CID_Pos       (28U)
#define FMC_HWCFGR2_MAX_CID_Msk       (0xFU << FMC_HWCFGR2_MAX_CID_Pos)      /*!< 0xF0000000 */
#define FMC_HWCFGR2_MAX_CID           FMC_HWCFGR2_MAX_CID_Msk                /*!< Maximum compartment ID (also known as CID) */

/***************  Bit definition for FMC_HWCFGR1 register  ****************/
#define FMC_HWCFGR1_NAND_SEL_Pos      (0U)
#define FMC_HWCFGR1_NAND_SEL_Msk      (0x1U << FMC_HWCFGR1_NAND_SEL_Pos)     /*!< 0x00000001 */
#define FMC_HWCFGR1_NAND_SEL          FMC_HWCFGR1_NAND_SEL_Msk               /*!< NAND Controller Selection */
#define FMC_HWCFGR1_NAND_ECC_Pos      (4U)
#define FMC_HWCFGR1_NAND_ECC_Msk      (0x1U << FMC_HWCFGR1_NAND_ECC_Pos)     /*!< 0x00000010 */
#define FMC_HWCFGR1_NAND_ECC          FMC_HWCFGR1_NAND_ECC_Msk               /*!< NAND ECC */
#define FMC_HWCFGR1_SDRAM_SEL_Pos     (8U)
#define FMC_HWCFGR1_SDRAM_SEL_Msk     (0x1U << FMC_HWCFGR1_SDRAM_SEL_Pos)    /*!< 0x00000100 */
#define FMC_HWCFGR1_SDRAM_SEL         FMC_HWCFGR1_SDRAM_SEL_Msk              /*!< SDRAM controller selection */
#define FMC_HWCFGR1_ID_SIZE_Pos       (12U)
#define FMC_HWCFGR1_ID_SIZE_Msk       (0xFU << FMC_HWCFGR1_ID_SIZE_Pos)      /*!< 0x0000F000 */
#define FMC_HWCFGR1_ID_SIZE           FMC_HWCFGR1_ID_SIZE_Msk                /*!< AXI ID signals width */
#define FMC_HWCFGR1_WA_LN2DPTH_Pos    (16U)
#define FMC_HWCFGR1_WA_LN2DPTH_Msk    (0xFU << FMC_HWCFGR1_WA_LN2DPTH_Pos)   /*!< 0x000F0000 */
#define FMC_HWCFGR1_WA_LN2DPTH        FMC_HWCFGR1_WA_LN2DPTH_Msk             /*!< AXI write address FIFO depth */
#define FMC_HWCFGR1_WD_LN2DPTH_Pos    (20U)
#define FMC_HWCFGR1_WD_LN2DPTH_Msk    (0xFU << FMC_HWCFGR1_WD_LN2DPTH_Pos)   /*!< 0x00F00000 */
#define FMC_HWCFGR1_WD_LN2DPTH        FMC_HWCFGR1_WD_LN2DPTH_Msk             /*!< AXI write data FIFO depth */
#define FMC_HWCFGR1_WR_LN2DPTH_Pos    (24U)
#define FMC_HWCFGR1_WR_LN2DPTH_Msk    (0xFU << FMC_HWCFGR1_WR_LN2DPTH_Pos)   /*!< 0x0F000000 */
#define FMC_HWCFGR1_WR_LN2DPTH        FMC_HWCFGR1_WR_LN2DPTH_Msk             /*!< AXI write response FIFO depth */
#define FMC_HWCFGR1_RA_LN2DPTH_Pos    (28U)
#define FMC_HWCFGR1_RA_LN2DPTH_Msk    (0xFU << FMC_HWCFGR1_RA_LN2DPTH_Pos)   /*!< 0xF0000000 */
#define FMC_HWCFGR1_RA_LN2DPTH        FMC_HWCFGR1_RA_LN2DPTH_Msk             /*!< AXI read address FIFO depth */

/*****************  Bit definition for FMC_VERR register  *****************/
#define FMC_VERR_MINREV_Pos           (0U)
#define FMC_VERR_MINREV_Msk           (0xFU << FMC_VERR_MINREV_Pos)          /*!< 0x0000000F */
#define FMC_VERR_MINREV               FMC_VERR_MINREV_Msk                    /*!< Minor revision */
#define FMC_VERR_MAJREV_Pos           (4U)
#define FMC_VERR_MAJREV_Msk           (0xFU << FMC_VERR_MAJREV_Pos)          /*!< 0x000000F0 */
#define FMC_VERR_MAJREV               FMC_VERR_MAJREV_Msk                    /*!< Major revision */

/****************  Bit definition for FMC_IPIDR register  *****************/
#define FMC_IPIDR_ID_Pos              (0U)
#define FMC_IPIDR_ID_Msk              (0xFFFFFFFFU << FMC_IPIDR_ID_Pos)      /*!< 0xFFFFFFFF */
#define FMC_IPIDR_ID                  FMC_IPIDR_ID_Msk                       /*!< FMC Identifier */

/*****************  Bit definition for FMC_SIDR register  *****************/
#define FMC_SIDR_SID_Pos              (0U)
#define FMC_SIDR_SID_Msk              (0xFFFFFFFFU << FMC_SIDR_SID_Pos)      /*!< 0xFFFFFFFF */
#define FMC_SIDR_SID                  FMC_SIDR_SID_Msk                       /*!< Size Identification */

/******************************************************************************/
/*                                                                            */
/*                            General Purpose I/O                             */
/*                                                                            */
/******************************************************************************/
/******************  Bits definition for GPIO_MODER register  *****************/
#define GPIO_MODER_MODER0_Pos            (0U)
#define GPIO_MODER_MODER0_Msk            (0x3UL << GPIO_MODER_MODER0_Pos)       /*!< 0x00000003 */
#define GPIO_MODER_MODER0                GPIO_MODER_MODER0_Msk
#define GPIO_MODER_MODER0_0              (0x1UL << GPIO_MODER_MODER0_Pos)       /*!< 0x00000001 */
#define GPIO_MODER_MODER0_1              (0x2UL << GPIO_MODER_MODER0_Pos)       /*!< 0x00000002 */

