zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131axx_ca7.h
/*****************  Bit definition for RCC_OCENCLRR register  *****************/
#define RCC_OCENCLRR_HSION_Pos                     (0U)
#define RCC_OCENCLRR_HSION_Msk                     (0x1UL << RCC_OCENCLRR_HSION_Pos)                    /*!< 0x00000001 */
#define RCC_OCENCLRR_HSION                         RCC_OCENCLRR_HSION_Msk                              /*!< Clear of HSION bit Cleared by software to disable the HSI clock. This bit must be written by a secure agent if the HSI clock is configured as secure (i.e. if RCC_SECCFGR.HSISEC=1). */
#define RCC_OCENCLRR_HSIKERON_Pos                  (1U)
#define RCC_OCENCLRR_HSIKERON_Msk                  (0x1UL << RCC_OCENCLRR_HSIKERON_Pos)                 /*!< 0x00000002 */
#define RCC_OCENCLRR_HSIKERON                      RCC_OCENCLRR_HSIKERON_Msk                           /*!< Clear of HSIKERON bit Cleared by software in order to allow the HSI to be switched off in one of the Stop modes. This bit must be written by a secure agent if the HSI clock is configured as secure (i.e. if RCC_SECCFGR.HSISEC=1). This bit has no effect on the value of HSION. */
#define RCC_OCENCLRR_CSION_Pos                     (4U)
#define RCC_OCENCLRR_CSION_Msk                     (0x1UL << RCC_OCENCLRR_CSION_Pos)                    /*!< 0x00000010 */
#define RCC_OCENCLRR_CSION                         RCC_OCENCLRR_CSION_Msk                              /*!< Clear of CSION bit Cleared by software to disable the CSI clock. This bit must be written by a secure agent if the CSI clock is configured as secure (i.e. if RCC_SECCFGR.CSISEC=1). */
#define RCC_OCENCLRR_CSIKERON_Pos                  (5U)
#define RCC_OCENCLRR_CSIKERON_Msk                  (0x1UL << RCC_OCENCLRR_CSIKERON_Pos)                 /*!< 0x00000020 */
#define RCC_OCENCLRR_CSIKERON                      RCC_OCENCLRR_CSIKERON_Msk                           /*!< Clear of CSIKERON bit Cleared by software in order to allow the CSI to be switched off in one of the Stop modes. This bit must be written by a secure agent if the CSI clock is configured as secure (i.e. if RCC_SECCFGR.CSISEC=1). This bit has no effect on the value of CSION. */
#define RCC_OCENCLRR_DIGBYP_Pos                    (7U)
#define RCC_OCENCLRR_DIGBYP_Msk                    (0x1UL << RCC_OCENCLRR_DIGBYP_Pos)                   /*!< 0x00000080 */
#define RCC_OCENCLRR_DIGBYP                        RCC_OCENCLRR_DIGBYP_Msk                             /*!< Clear of DIGBYP bit Cleared by software when the external clock connected to OSC_IN is a low-swing signal. This bit must be written by a secure agent if the HSE clock is configured as secure (i.e. if RCC_SECCFGR.HSESEC=1). */
#define RCC_OCENCLRR_HSEON_Pos                     (8U)
#define RCC_OCENCLRR_HSEON_Msk                     (0x1UL << RCC_OCENCLRR_HSEON_Pos)                    /*!< 0x00000100 */
#define RCC_OCENCLRR_HSEON                         RCC_OCENCLRR_HSEON_Msk                              /*!< Clear of HSEON bit Cleared by software to disable the HSE clock. This bit must be written by a secure agent if the HSE clock is configured as secure (i.e. if RCC_SECCFGR.HSESEC=1). */
#define RCC_OCENCLRR_HSEKERON_Pos                  (9U)
#define RCC_OCENCLRR_HSEKERON_Msk                  (0x1UL << RCC_OCENCLRR_HSEKERON_Pos)                 /*!< 0x00000200 */
#define RCC_OCENCLRR_HSEKERON                      RCC_OCENCLRR_HSEKERON_Msk                           /*!< Clear HSEKERON bit Cleared by software in order to allow the HSE to be switched off in one of the Stop modes. This bit must be written by a secure agent if the HSE clock is configured as secure (i.e. if RCC_SECCFGR.HSESEC=1). */
#define RCC_OCENCLRR_HSEBYP_Pos                    (10U)
#define RCC_OCENCLRR_HSEBYP_Msk                    (0x1UL << RCC_OCENCLRR_HSEBYP_Pos)                   /*!< 0x00000400 */
#define RCC_OCENCLRR_HSEBYP                        RCC_OCENCLRR_HSEBYP_Msk                             /*!< Clear the HSEBYP bit Cleared by software in order to disable the bypass mode. This bit must be written by a secure agent if the HSE clock is configured as secure (i.e. if RCC_SECCFGR.HSESEC=1). */

/******************  Bit definition for RCC_OCRDYR register  ******************/
#define RCC_OCRDYR_HSIRDY_Pos                      (0U)
#define RCC_OCRDYR_HSIRDY_Msk                      (0x1UL << RCC_OCRDYR_HSIRDY_Pos)                     /*!< 0x00000001 */
#define RCC_OCRDYR_HSIRDY                          RCC_OCRDYR_HSIRDY_Msk                               /*!< HSI clock ready flag Set by hardware to indicate that the HSI oscillator is stable. */
#define RCC_OCRDYR_HSIDIVRDY_Pos                   (2U)
#define RCC_OCRDYR_HSIDIVRDY_Msk                   (0x1UL << RCC_OCRDYR_HSIDIVRDY_Pos)                  /*!< 0x00000004 */
#define RCC_OCRDYR_HSIDIVRDY                       RCC_OCRDYR_HSIDIVRDY_Msk                            /*!< HSI divider ready flag Set and reset by hardware. As a write in HSIDIV has not an immediate effect on the frequency, this flag indicates the current status of the HSI divider. HSIDIVF will go immediately to '0' when HSIDIV value is changed, and will be set back to '1' when the output frequency matches the value programmed into HSIDIV */
#define RCC_OCRDYR_CSIRDY_Pos                      (4U)
#define RCC_OCRDYR_CSIRDY_Msk                      (0x1UL << RCC_OCRDYR_CSIRDY_Pos)                     /*!< 0x00000010 */
#define RCC_OCRDYR_CSIRDY                          RCC_OCRDYR_CSIRDY_Msk                               /*!< CSI clock ready flag Set by hardware to indicate that the CSI oscillator is stable. */
#define RCC_OCRDYR_HSERDY_Pos                      (8U)
#define RCC_OCRDYR_HSERDY_Msk                      (0x1UL << RCC_OCRDYR_HSERDY_Pos)                     /*!< 0x00000100 */
#define RCC_OCRDYR_HSERDY                          RCC_OCRDYR_HSERDY_Msk                               /*!< HSE clock ready flag Set by hardware to indicate that the HSE oscillator is stable. */
#define RCC_OCRDYR_MPUCKRDY_Pos                    (23U)
#define RCC_OCRDYR_MPUCKRDY_Msk                    (0x1UL << RCC_OCRDYR_MPUCKRDY_Pos)                   /*!< 0x00800000 */
#define RCC_OCRDYR_MPUCKRDY                        RCC_OCRDYR_MPUCKRDY_Msk                             /*!< MPU clock ready flag Set by hardware to indicate that the mpuss_ck clock is available. */
#define RCC_OCRDYR_AXICKRDY_Pos                    (24U)
#define RCC_OCRDYR_AXICKRDY_Msk                    (0x1UL << RCC_OCRDYR_AXICKRDY_Pos)                   /*!< 0x01000000 */
#define RCC_OCRDYR_AXICKRDY                        RCC_OCRDYR_AXICKRDY_Msk                             /*!< AXI sub-system clock ready flag Set by hardware to indicate that the axiss_ck clock is available. */

