zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131axx_ca7.h
/*****************  Bit definition for RCC_RTCDIVR register  ******************/
#define RCC_RTCDIVR_RTCDIV_Pos                     (0U)
#define RCC_RTCDIVR_RTCDIV_Msk                     (0x3FUL << RCC_RTCDIVR_RTCDIV_Pos)                   /*!< 0x0000003F */
#define RCC_RTCDIVR_RTCDIV                         RCC_RTCDIVR_RTCDIV_Msk                              /*!< HSE division factor for RTC clock Set and cleared by software to divide the HSE to generate a clock for RTC. Caution: The software has to set these bits correctly to ensure that the clock supplied to the RTC is lower than 4 MHz. These bits must be configured if needed before selecting the RTC clock source. Note that when the RTCSRC is different from 3, this divider is disabled (does not provide clock). ... */
#define RCC_RTCDIVR_RTCDIV_0                       (0x1UL << RCC_RTCDIVR_RTCDIV_Pos)                    /*!< 0x00000001 */
#define RCC_RTCDIVR_RTCDIV_1                       (0x2UL << RCC_RTCDIVR_RTCDIV_Pos)                    /*!< 0x00000002 */
#define RCC_RTCDIVR_RTCDIV_2                       (0x4UL << RCC_RTCDIVR_RTCDIV_Pos)                    /*!< 0x00000004 */
#define RCC_RTCDIVR_RTCDIV_3                       (0x8UL << RCC_RTCDIVR_RTCDIV_Pos)                    /*!< 0x00000008 */
#define RCC_RTCDIVR_RTCDIV_4                       (0x10UL << RCC_RTCDIVR_RTCDIV_Pos)                   /*!< 0x00000010 */
#define RCC_RTCDIVR_RTCDIV_5                       (0x20UL << RCC_RTCDIVR_RTCDIV_Pos)                   /*!< 0x00000020 */

/*****************  Bit definition for RCC_MPCKDIVR register  *****************/
#define RCC_MPCKDIVR_MPUDIV_Pos                    (0U)
#define RCC_MPCKDIVR_MPUDIV_Msk                    (0xFUL << RCC_MPCKDIVR_MPUDIV_Pos)                   /*!< 0x0000000F */
#define RCC_MPCKDIVR_MPUDIV                        RCC_MPCKDIVR_MPUDIV_Msk                             /*!< MPU Core clock divider Written by software to control the MPU clock division factor when the MPUSRC is set to position 3. It is possible to change this division ratio on-the-fly. It impacts only the frequency of the MPU clock. The clocks are divided with the new prescaler factor, from 1 to 16 pll1_p_ck cycles after MPUDIV update. The application can check if the new division factor is taken into account by reading back the MPUDIVRDY flag. Note that this divider is disabled if MPUSRC[1:0] is different from '11'. 0x */
#define RCC_MPCKDIVR_MPUDIV_0                      (0x1UL << RCC_MPCKDIVR_MPUDIV_Pos)                   /*!< 0x00000001 */
#define RCC_MPCKDIVR_MPUDIV_1                      (0x2UL << RCC_MPCKDIVR_MPUDIV_Pos)                   /*!< 0x00000002 */
#define RCC_MPCKDIVR_MPUDIV_2                      (0x4UL << RCC_MPCKDIVR_MPUDIV_Pos)                   /*!< 0x00000004 */
#define RCC_MPCKDIVR_MPUDIV_3                      (0x8UL << RCC_MPCKDIVR_MPUDIV_Pos)                   /*!< 0x00000008 */
#define RCC_MPCKDIVR_MPUDIVRDY_Pos                 (31U)
#define RCC_MPCKDIVR_MPUDIVRDY_Msk                 (0x1UL << RCC_MPCKDIVR_MPUDIVRDY_Pos)                /*!< 0x80000000 */
#define RCC_MPCKDIVR_MPUDIVRDY                     RCC_MPCKDIVR_MPUDIVRDY_Msk                          /*!< MPU sub-system clock divider status Set and reset by hardware to indicate if the new division factor is taken into account. This bit significant only when MPUSRC[1:0] = '11'. */

/*****************  Bit definition for RCC_AXIDIVR register  ******************/
#define RCC_AXIDIVR_AXIDIV_Pos                     (0U)
#define RCC_AXIDIVR_AXIDIV_Msk                     (0x7UL << RCC_AXIDIVR_AXIDIV_Pos)                    /*!< 0x00000007 */
#define RCC_AXIDIVR_AXIDIV                         RCC_AXIDIVR_AXIDIV_Msk                              /*!< AXI, AHB5 and AHB6 clock divider Written by software to control the AXI, AHB5 and AHB6 clock division factor. It is possible to change this division ratio on-the-fly. It impacts the frequency of AXI, APB4, APB5 AHB5 and AHB6 clocks. The clocks are divided with the new prescaler factor, from 1 to 4 axiss_ck cycles after AXIDIV update. The application can check if the new division factor is taken into account by reading back the AXIDIVRDY flag. others: axiss_ck / 4 */
#define RCC_AXIDIVR_AXIDIV_0                       (0x1UL << RCC_AXIDIVR_AXIDIV_Pos)                    /*!< 0x00000001 */
#define RCC_AXIDIVR_AXIDIV_1                       (0x2UL << RCC_AXIDIVR_AXIDIV_Pos)                    /*!< 0x00000002 */
#define RCC_AXIDIVR_AXIDIV_2                       (0x4UL << RCC_AXIDIVR_AXIDIV_Pos)                    /*!< 0x00000004 */
#define RCC_AXIDIVR_AXIDIVRDY_Pos                  (31U)
#define RCC_AXIDIVR_AXIDIVRDY_Msk                  (0x1UL << RCC_AXIDIVR_AXIDIVRDY_Pos)                 /*!< 0x80000000 */
#define RCC_AXIDIVR_AXIDIVRDY                      RCC_AXIDIVR_AXIDIVRDY_Msk                           /*!< AXI sub-system clock divider status Set and reset by hardware to indicate if the new division factor is taken into account. */

/****************  Bit definition for RCC_MLAHBDIVR register  *****************/
#define RCC_MLAHBDIVR_MLAHBDIV_Pos                 (0U)
#define RCC_MLAHBDIVR_MLAHBDIV_Msk                 (0xFUL << RCC_MLAHBDIVR_MLAHBDIV_Pos)                /*!< 0x0000000F */
#define RCC_MLAHBDIVR_MLAHBDIV                     RCC_MLAHBDIVR_MLAHBDIV_Msk                          /*!< MLAHB clock divider Written by software to control the MLAHB clock division factor. Changing this division ratio has an impact on the frequency of MLAHB clock, and all bus matrix clocks. The clocks are divided with the new prescaler factor, from 1 to 512 cycles of mlahbss_ck, after MLAHBDIV update. The application can check if the new division factor is taken into account by reading back the MLAHBDIVRDY flag. others: mlahbss_ck divided by 512 */
#define RCC_MLAHBDIVR_MLAHBDIV_0                   (0x1UL << RCC_MLAHBDIVR_MLAHBDIV_Pos)                /*!< 0x00000001 */
#define RCC_MLAHBDIVR_MLAHBDIV_1                   (0x2UL << RCC_MLAHBDIVR_MLAHBDIV_Pos)                /*!< 0x00000002 */
#define RCC_MLAHBDIVR_MLAHBDIV_2                   (0x4UL << RCC_MLAHBDIVR_MLAHBDIV_Pos)                /*!< 0x00000004 */
#define RCC_MLAHBDIVR_MLAHBDIV_3                   (0x8UL << RCC_MLAHBDIVR_MLAHBDIV_Pos)                /*!< 0x00000008 */
#define RCC_MLAHBDIVR_MLAHBDIVRDY_Pos              (31U)
#define RCC_MLAHBDIVR_MLAHBDIVRDY_Msk              (0x1UL << RCC_MLAHBDIVR_MLAHBDIVRDY_Pos)             /*!< 0x80000000 */
#define RCC_MLAHBDIVR_MLAHBDIVRDY                  RCC_MLAHBDIVR_MLAHBDIVRDY_Msk                       /*!< MLAHB clock prescaler status Set and reset by hardware to indicate if the new division factor is taken into account. */

