zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131axx_ca7.h
/****************  Bit definition for RCC_TIMG2PRER register  *****************/
#define RCC_TIMG2PRER_TIMG2PRE_Pos                 (0U)
#define RCC_TIMG2PRER_TIMG2PRE_Msk                 (0x1UL << RCC_TIMG2PRER_TIMG2PRE_Pos)                /*!< 0x00000001 */
#define RCC_TIMG2PRER_TIMG2PRE                     RCC_TIMG2PRER_TIMG2PRE_Msk                          /*!< Timers clocks prescaler selection This bit is set and reset by software to control the clock frequency of all the timers connected to APB2 domain. Refer to . */
#define RCC_TIMG2PRER_TIMG2PRERDY_Pos              (31U)
#define RCC_TIMG2PRER_TIMG2PRERDY_Msk              (0x1UL << RCC_TIMG2PRER_TIMG2PRERDY_Pos)             /*!< 0x80000000 */
#define RCC_TIMG2PRER_TIMG2PRERDY                  RCC_TIMG2PRER_TIMG2PRERDY_Msk                       /*!< Timers clocks prescaler status Set and reset by hardware to indicate if the new division factor is taken into account. */

/****************  Bit definition for RCC_TIMG3PRER register  *****************/
#define RCC_TIMG3PRER_TIMG3PRE_Pos                 (0U)
#define RCC_TIMG3PRER_TIMG3PRE_Msk                 (0x1UL << RCC_TIMG3PRER_TIMG3PRE_Pos)                /*!< 0x00000001 */
#define RCC_TIMG3PRER_TIMG3PRE                     RCC_TIMG3PRER_TIMG3PRE_Msk                          /*!< Timers clocks prescaler selection This bit is set and reset by software to control the clock frequency of all the timers connected to APB6 domain. Refer to . */
#define RCC_TIMG3PRER_TIMG3PRERDY_Pos              (31U)
#define RCC_TIMG3PRER_TIMG3PRERDY_Msk              (0x1UL << RCC_TIMG3PRER_TIMG3PRERDY_Pos)             /*!< 0x80000000 */
#define RCC_TIMG3PRER_TIMG3PRERDY                  RCC_TIMG3PRER_TIMG3PRERDY_Msk                       /*!< Timers clocks prescaler status Set and reset by hardware to indicate if the new division factor is taken into account. */

/*****************  Bit definition for RCC_DDRITFCR register  *****************/
#define RCC_DDRITFCR_DDRC1EN_Pos                   (0U)
#define RCC_DDRITFCR_DDRC1EN_Msk                   (0x1UL << RCC_DDRITFCR_DDRC1EN_Pos)                  /*!< 0x00000001 */
#define RCC_DDRITFCR_DDRC1EN                       RCC_DDRITFCR_DDRC1EN_Msk                            /*!< DDRC port 1 peripheral clocks enable If DDRC block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set and clear by software. This bit is controlling the gating of ddrc_ker_ckg, aclk1_ddrc and pclk4_ddrc clocks. */
#define RCC_DDRITFCR_DDRC1LPEN_Pos                 (1U)
#define RCC_DDRITFCR_DDRC1LPEN_Msk                 (0x1UL << RCC_DDRITFCR_DDRC1LPEN_Pos)                /*!< 0x00000002 */
#define RCC_DDRITFCR_DDRC1LPEN                     RCC_DDRITFCR_DDRC1LPEN_Msk                          /*!< DDRC port 1 peripheral clocks enable during CSleep mode If DDRC block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set and clear by software. This bit is controlling the gating of ddrc_ker_ckg, aclk1_ddrc and pclk4_ddrc in CSleep. */
#define RCC_DDRITFCR_DDRPHYCEN_Pos                 (4U)
#define RCC_DDRITFCR_DDRPHYCEN_Msk                 (0x1UL << RCC_DDRITFCR_DDRPHYCEN_Pos)                /*!< 0x00000010 */
#define RCC_DDRITFCR_DDRPHYCEN                     RCC_DDRITFCR_DDRPHYCEN_Msk                          /*!< DDRPHYC peripheral clocks enable If DDRPHYC block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set and clear by software. This bit is controlling the gating of dphy_ker_ck and pclk4_dphy */
#define RCC_DDRITFCR_DDRPHYCLPEN_Pos               (5U)
#define RCC_DDRITFCR_DDRPHYCLPEN_Msk               (0x1UL << RCC_DDRITFCR_DDRPHYCLPEN_Pos)              /*!< 0x00000020 */
#define RCC_DDRITFCR_DDRPHYCLPEN                   RCC_DDRITFCR_DDRPHYCLPEN_Msk                        /*!< DDRPHYC peripheral clocks enable during CSleep mode If DDRPHYC block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set and clear by software. This bit is controlling the gating of dphy_ker_ck and pclk4_dphy in CSleep */
#define RCC_DDRITFCR_DDRCAPBEN_Pos                 (6U)
#define RCC_DDRITFCR_DDRCAPBEN_Msk                 (0x1UL << RCC_DDRITFCR_DDRCAPBEN_Pos)                /*!< 0x00000040 */
#define RCC_DDRITFCR_DDRCAPBEN                     RCC_DDRITFCR_DDRCAPBEN_Msk                          /*!< DDRC APB clock enable If DDRC block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set and clear by software. This bit is controlling the gating of pclk4_ddrc clock. */
#define RCC_DDRITFCR_DDRCAPBLPEN_Pos               (7U)
#define RCC_DDRITFCR_DDRCAPBLPEN_Msk               (0x1UL << RCC_DDRITFCR_DDRCAPBLPEN_Pos)              /*!< 0x00000080 */
#define RCC_DDRITFCR_DDRCAPBLPEN                   RCC_DDRITFCR_DDRCAPBLPEN_Msk                        /*!< DDRC APB clock enable during CSleep mode If DDRC block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set and clear by software. This bit is controlling the gating of pclk4_ddrc clock during CSleep mode. */
#define RCC_DDRITFCR_AXIDCGEN_Pos                  (8U)
#define RCC_DDRITFCR_AXIDCGEN_Msk                  (0x1UL << RCC_DDRITFCR_AXIDCGEN_Pos)                 /*!< 0x00000100 */
#define RCC_DDRITFCR_AXIDCGEN                      RCC_DDRITFCR_AXIDCGEN_Msk                           /*!< AXIDCG enable during MPU CRun mode If DDRC block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set and clear by software. When the dynamic clock gating is disabled, the clock is always provided to the DDRC if provided by the RCC. */
#define RCC_DDRITFCR_DDRPHYCAPBEN_Pos              (9U)
#define RCC_DDRITFCR_DDRPHYCAPBEN_Msk              (0x1UL << RCC_DDRITFCR_DDRPHYCAPBEN_Pos)             /*!< 0x00000200 */
#define RCC_DDRITFCR_DDRPHYCAPBEN                  RCC_DDRITFCR_DDRPHYCAPBEN_Msk                       /*!< DDRPHYC APB clock enable If DDRC block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set and clear by software. This bit is controlling the gating of pclk4_dphy clock. */
#define RCC_DDRITFCR_DDRPHYCAPBLPEN_Pos            (10U)
#define RCC_DDRITFCR_DDRPHYCAPBLPEN_Msk            (0x1UL << RCC_DDRITFCR_DDRPHYCAPBLPEN_Pos)           /*!< 0x00000400 */
#define RCC_DDRITFCR_DDRPHYCAPBLPEN                RCC_DDRITFCR_DDRPHYCAPBLPEN_Msk                     /*!< DDRPHYC APB clock enable during CSleep mode If DDRC block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set and clear by software. This bit is controlling the gating of pclk4_dphy clock during CSleep mode. */
#define RCC_DDRITFCR_KERDCG_DLY_Pos                (11U)
#define RCC_DDRITFCR_KERDCG_DLY_Msk                (0x7UL << RCC_DDRITFCR_KERDCG_DLY_Pos)               /*!< 0x00003800 */
#define RCC_DDRITFCR_KERDCG_DLY                    RCC_DDRITFCR_KERDCG_DLY_Msk                         /*!< AXIDCG delay If DDRC block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set and clear by software. It represents the delay between the falling edge of the cactive_ddrc signal and the moment where the KERDCG will gate the ddrc_ker_ckg. ... */
#define RCC_DDRITFCR_KERDCG_DLY_0                  (0x1UL << RCC_DDRITFCR_KERDCG_DLY_Pos)             /*!< 0x00000800 */
#define RCC_DDRITFCR_KERDCG_DLY_1                  (0x2UL << RCC_DDRITFCR_KERDCG_DLY_Pos)            /*!< 0x00001000 */
#define RCC_DDRITFCR_KERDCG_DLY_2                  (0x4UL << RCC_DDRITFCR_KERDCG_DLY_Pos)            /*!< 0x00002000 */
#define RCC_DDRITFCR_DDRCAPBRST_Pos                (14U)
#define RCC_DDRITFCR_DDRCAPBRST_Msk                (0x1UL << RCC_DDRITFCR_DDRCAPBRST_Pos)               /*!< 0x00004000 */
#define RCC_DDRITFCR_DDRCAPBRST                    RCC_DDRITFCR_DDRCAPBRST_Msk                         /*!< DDRC APB interface reset If DDRC block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set and clear by software. */
#define RCC_DDRITFCR_DDRCAXIRST_Pos                (15U)
#define RCC_DDRITFCR_DDRCAXIRST_Msk                (0x1UL << RCC_DDRITFCR_DDRCAXIRST_Pos)               /*!< 0x00008000 */
#define RCC_DDRITFCR_DDRCAXIRST                    RCC_DDRITFCR_DDRCAXIRST_Msk                         /*!< DDRC AXI interface reset If DDRC block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set and clear by software. */
#define RCC_DDRITFCR_DDRCORERST_Pos                (16U)
#define RCC_DDRITFCR_DDRCORERST_Msk                (0x1UL << RCC_DDRITFCR_DDRCORERST_Pos)               /*!< 0x00010000 */
#define RCC_DDRITFCR_DDRCORERST                    RCC_DDRITFCR_DDRCORERST_Msk                         /*!< DDRC core reset If DDRC block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set and clear by software. */
#define RCC_DDRITFCR_DPHYAPBRST_Pos                (17U)
#define RCC_DDRITFCR_DPHYAPBRST_Msk                (0x1UL << RCC_DDRITFCR_DPHYAPBRST_Pos)               /*!< 0x00020000 */
#define RCC_DDRITFCR_DPHYAPBRST                    RCC_DDRITFCR_DPHYAPBRST_Msk                         /*!< DDRPHYC APB interface reset If DDRPHYC block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set and clear by software. */
#define RCC_DDRITFCR_DPHYRST_Pos                   (18U)
#define RCC_DDRITFCR_DPHYRST_Msk                   (0x1UL << RCC_DDRITFCR_DPHYRST_Pos)                  /*!< 0x00040000 */
#define RCC_DDRITFCR_DPHYRST                       RCC_DDRITFCR_DPHYRST_Msk                            /*!< DDRPHYC reset If DDRPHYC block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set and clear by software. */
#define RCC_DDRITFCR_DPHYCTLRST_Pos                (19U)
#define RCC_DDRITFCR_DPHYCTLRST_Msk                (0x1UL << RCC_DDRITFCR_DPHYCTLRST_Pos)               /*!< 0x00080000 */
#define RCC_DDRITFCR_DPHYCTLRST                    RCC_DDRITFCR_DPHYCTLRST_Msk                         /*!< DDRPHYC Control reset If DDRPHYC block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set and clear by software. */
#define RCC_DDRITFCR_DDRCKMOD_Pos                  (20U)
#define RCC_DDRITFCR_DDRCKMOD_Msk                  (0x7UL << RCC_DDRITFCR_DDRCKMOD_Pos)                 /*!< 0x00700000 */
#define RCC_DDRITFCR_DDRCKMOD                      RCC_DDRITFCR_DDRCKMOD_Msk                           /*!< RCC mode for DDR clock control If DDRC block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Written by software. This mode can be used when the application wants to maintain a clock to the DLLs in order to avoid the re-lock sequences. In this mode it is recommended to have DDRCxEN = DDRCxLPEN = DDRPHYCEN = DDRPHYCLPEN = '1'. This mode can be used when the DLLs are in bypass. In this mode it is recommended to have DDRCxEN = DDRCxLPEN = DDRPHYCEN = DDRPHYCLPEN = '1'. This mode can be used when the application wants to maintain a clock to the DLLs. In this mode it is recommended to have DDRCxEN = DDRCxLPEN = DDRPHYCEN = DDRPHYCLPEN = '1'. This mode can be used when the DLLs are in bypass. In this mode it is recommended to have DDRCxEN = DDRCxLPEN = DDRPHYCEN = DDRPHYCLPEN = '1'. other: reserved */
#define RCC_DDRITFCR_DDRCKMOD_0                    (0x1UL << RCC_DDRITFCR_DDRCKMOD_Pos)            /*!< 0x00100000 */
#define RCC_DDRITFCR_DDRCKMOD_1                    (0x2UL << RCC_DDRITFCR_DDRCKMOD_Pos)            /*!< 0x00200000 */
#define RCC_DDRITFCR_DDRCKMOD_2                    (0x4UL << RCC_DDRITFCR_DDRCKMOD_Pos)            /*!< 0x00400000 */
#define RCC_DDRITFCR_GSKPMOD_Pos                   (23U)
#define RCC_DDRITFCR_GSKPMOD_Msk                   (0x1UL << RCC_DDRITFCR_GSKPMOD_Pos)                  /*!< 0x00800000 */
#define RCC_DDRITFCR_GSKPMOD                       RCC_DDRITFCR_GSKPMOD_Msk                            /*!< Glitch Skipper (GSKP) Mode If DDRC block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set and clear by software. */
#define RCC_DDRITFCR_GSKPCTRL_Pos                  (24U)
#define RCC_DDRITFCR_GSKPCTRL_Msk                  (0x1UL << RCC_DDRITFCR_GSKPCTRL_Pos)                 /*!< 0x01000000 */
#define RCC_DDRITFCR_GSKPCTRL                      RCC_DDRITFCR_GSKPCTRL_Msk                           /*!< Glitch skipper (GSKP) control If DDRC block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set and clear by software. This has effect only if GSKPMOD = '0'. */
#define RCC_DDRITFCR_DFILP_WIDTH_Pos               (25U)
#define RCC_DDRITFCR_DFILP_WIDTH_Msk               (0x7UL << RCC_DDRITFCR_DFILP_WIDTH_Pos)              /*!< 0x0E000000 */
#define RCC_DDRITFCR_DFILP_WIDTH                   RCC_DDRITFCR_DFILP_WIDTH_Msk                        /*!< Minimum duration of low-power request command If DDRC block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Written by software. The low power request duration must always be bigger or equal to 1 microsecond. If this duration is not respected, the DDR interface behavior is not guaranteed. The application has to program properly DFILP_WIDTH in order to ensure a delay bigger or equal to 1 microsecond. Note that the delay is also dependent of the frequency of the dphy_ker_ck clock. Others: Forces a delay of 544 x Tdphy_ker_ck to be used when Fdphy_ker_ck is between 410 and 533MHz */
#define RCC_DDRITFCR_DFILP_WIDTH_0                 (0x1UL << RCC_DDRITFCR_DFILP_WIDTH_Pos)        /*!< 0x02000000 */
#define RCC_DDRITFCR_DFILP_WIDTH_1                 (0x2UL << RCC_DDRITFCR_DFILP_WIDTH_Pos)        /*!< 0x04000000 */
#define RCC_DDRITFCR_DFILP_WIDTH_2                 (0x4UL << RCC_DDRITFCR_DFILP_WIDTH_Pos)        /*!< 0x08000000 */
#define RCC_DDRITFCR_GSKP_DUR_Pos                  (28U)
#define RCC_DDRITFCR_GSKP_DUR_Msk                  (0xFUL << RCC_DDRITFCR_GSKP_DUR_Pos)                 /*!< 0xF0000000 */
#define RCC_DDRITFCR_GSKP_DUR                      RCC_DDRITFCR_GSKP_DUR_Msk                           /*!< Glitch skipper duration in automatic mode If DDRC block is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Written by software. This field allow the application to define the amount of time where the glitch skipper is providing the clock dphy_ker_ck instead of the clock ddrc_ker_ck to the DDRC block. This feature is only working when the glitch skipper is set in automatic mode (GSKPMOD = '1'). This delay is equal to (GSKP_DUR + 1) x 32 x Tdphy_ker_ck ... */
#define RCC_DDRITFCR_GSKP_DUR_0                    (0x1UL << RCC_DDRITFCR_GSKP_DUR_Pos)          /*!< 0x10000000 */
#define RCC_DDRITFCR_GSKP_DUR_1                    (0x2UL << RCC_DDRITFCR_GSKP_DUR_Pos)          /*!< 0x20000000 */
#define RCC_DDRITFCR_GSKP_DUR_2                    (0x4UL << RCC_DDRITFCR_GSKP_DUR_Pos)          /*!< 0x40000000 */
#define RCC_DDRITFCR_GSKP_DUR_3                    (0x8UL << RCC_DDRITFCR_GSKP_DUR_Pos)          /*!< 0x80000000 */

