zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131axx_ca7.h
/****************  Bit definition for RCC_SAESCKSELR register  ****************/
#define RCC_SAESCKSELR_SAESSRC_Pos                 (0U)
#define RCC_SAESCKSELR_SAESSRC_Msk                 (0x3UL << RCC_SAESCKSELR_SAESSRC_Pos)                /*!< 0x00000003 */
#define RCC_SAESCKSELR_SAESSRC                     RCC_SAESCKSELR_SAESSRC_Msk                          /*!< SAES kernel clock source selection Written by software. */
#define RCC_SAESCKSELR_SAESSRC_0                   (0x1UL << RCC_SAESCKSELR_SAESSRC_Pos)                /*!< 0x00000001 */
#define RCC_SAESCKSELR_SAESSRC_1                   (0x2UL << RCC_SAESCKSELR_SAESSRC_Pos)                /*!< 0x00000002 */

/***************  Bit definition for RCC_APB1RSTSETR register  ****************/
#define RCC_APB1RSTSETR_TIM2RST_Pos                (0U)
#define RCC_APB1RSTSETR_TIM2RST_Msk                (0x1UL << RCC_APB1RSTSETR_TIM2RST_Pos)               /*!< 0x00000001 */
#define RCC_APB1RSTSETR_TIM2RST                    RCC_APB1RSTSETR_TIM2RST_Msk                         /*!< TIM2 block reset Set by software. */
#define RCC_APB1RSTSETR_TIM3RST_Pos                (1U)
#define RCC_APB1RSTSETR_TIM3RST_Msk                (0x1UL << RCC_APB1RSTSETR_TIM3RST_Pos)               /*!< 0x00000002 */
#define RCC_APB1RSTSETR_TIM3RST                    RCC_APB1RSTSETR_TIM3RST_Msk                         /*!< TIM3 block reset Set by software. */
#define RCC_APB1RSTSETR_TIM4RST_Pos                (2U)
#define RCC_APB1RSTSETR_TIM4RST_Msk                (0x1UL << RCC_APB1RSTSETR_TIM4RST_Pos)               /*!< 0x00000004 */
#define RCC_APB1RSTSETR_TIM4RST                    RCC_APB1RSTSETR_TIM4RST_Msk                         /*!< TIM4 block reset Set by software. */
#define RCC_APB1RSTSETR_TIM5RST_Pos                (3U)
#define RCC_APB1RSTSETR_TIM5RST_Msk                (0x1UL << RCC_APB1RSTSETR_TIM5RST_Pos)               /*!< 0x00000008 */
#define RCC_APB1RSTSETR_TIM5RST                    RCC_APB1RSTSETR_TIM5RST_Msk                         /*!< TIM5 block reset Set by software. */
#define RCC_APB1RSTSETR_TIM6RST_Pos                (4U)
#define RCC_APB1RSTSETR_TIM6RST_Msk                (0x1UL << RCC_APB1RSTSETR_TIM6RST_Pos)               /*!< 0x00000010 */
#define RCC_APB1RSTSETR_TIM6RST                    RCC_APB1RSTSETR_TIM6RST_Msk                         /*!< TIM6 block reset Set by software. */
#define RCC_APB1RSTSETR_TIM7RST_Pos                (5U)
#define RCC_APB1RSTSETR_TIM7RST_Msk                (0x1UL << RCC_APB1RSTSETR_TIM7RST_Pos)               /*!< 0x00000020 */
#define RCC_APB1RSTSETR_TIM7RST                    RCC_APB1RSTSETR_TIM7RST_Msk                         /*!< TIM7 block reset Set by software. */
#define RCC_APB1RSTSETR_LPTIM1RST_Pos              (9U)
#define RCC_APB1RSTSETR_LPTIM1RST_Msk              (0x1UL << RCC_APB1RSTSETR_LPTIM1RST_Pos)             /*!< 0x00000200 */
#define RCC_APB1RSTSETR_LPTIM1RST                  RCC_APB1RSTSETR_LPTIM1RST_Msk                       /*!< LPTIM1 block reset Set by software. */
#define RCC_APB1RSTSETR_SPI2RST_Pos                (11U)
#define RCC_APB1RSTSETR_SPI2RST_Msk                (0x1UL << RCC_APB1RSTSETR_SPI2RST_Pos)               /*!< 0x00000800 */
#define RCC_APB1RSTSETR_SPI2RST                    RCC_APB1RSTSETR_SPI2RST_Msk                         /*!< SPI/I2S2 block reset Set by software. */
#define RCC_APB1RSTSETR_SPI3RST_Pos                (12U)
#define RCC_APB1RSTSETR_SPI3RST_Msk                (0x1UL << RCC_APB1RSTSETR_SPI3RST_Pos)               /*!< 0x00001000 */
#define RCC_APB1RSTSETR_SPI3RST                    RCC_APB1RSTSETR_SPI3RST_Msk                         /*!< SPI3 block reset Set by software. */
#define RCC_APB1RSTSETR_USART3RST_Pos              (15U)
#define RCC_APB1RSTSETR_USART3RST_Msk              (0x1UL << RCC_APB1RSTSETR_USART3RST_Pos)             /*!< 0x00008000 */
#define RCC_APB1RSTSETR_USART3RST                  RCC_APB1RSTSETR_USART3RST_Msk                       /*!< USART3 block reset Set by software. */
#define RCC_APB1RSTSETR_UART4RST_Pos               (16U)
#define RCC_APB1RSTSETR_UART4RST_Msk               (0x1UL << RCC_APB1RSTSETR_UART4RST_Pos)              /*!< 0x00010000 */
#define RCC_APB1RSTSETR_UART4RST                   RCC_APB1RSTSETR_UART4RST_Msk                        /*!< UART4 block reset Set by software. */
#define RCC_APB1RSTSETR_UART5RST_Pos               (17U)
#define RCC_APB1RSTSETR_UART5RST_Msk               (0x1UL << RCC_APB1RSTSETR_UART5RST_Pos)              /*!< 0x00020000 */
#define RCC_APB1RSTSETR_UART5RST                   RCC_APB1RSTSETR_UART5RST_Msk                        /*!< UART5 block reset Set by software. */
#define RCC_APB1RSTSETR_UART7RST_Pos               (18U)
#define RCC_APB1RSTSETR_UART7RST_Msk               (0x1UL << RCC_APB1RSTSETR_UART7RST_Pos)              /*!< 0x00040000 */
#define RCC_APB1RSTSETR_UART7RST                   RCC_APB1RSTSETR_UART7RST_Msk                        /*!< UART7 block reset Set by software. */
#define RCC_APB1RSTSETR_UART8RST_Pos               (19U)
#define RCC_APB1RSTSETR_UART8RST_Msk               (0x1UL << RCC_APB1RSTSETR_UART8RST_Pos)              /*!< 0x00080000 */
#define RCC_APB1RSTSETR_UART8RST                   RCC_APB1RSTSETR_UART8RST_Msk                        /*!< UART8 block reset Set by software. */
#define RCC_APB1RSTSETR_I2C1RST_Pos                (21U)
#define RCC_APB1RSTSETR_I2C1RST_Msk                (0x1UL << RCC_APB1RSTSETR_I2C1RST_Pos)               /*!< 0x00200000 */
#define RCC_APB1RSTSETR_I2C1RST                    RCC_APB1RSTSETR_I2C1RST_Msk                         /*!< I2C1 block reset Set by software. */
#define RCC_APB1RSTSETR_I2C2RST_Pos                (22U)
#define RCC_APB1RSTSETR_I2C2RST_Msk                (0x1UL << RCC_APB1RSTSETR_I2C2RST_Pos)               /*!< 0x00400000 */
#define RCC_APB1RSTSETR_I2C2RST                    RCC_APB1RSTSETR_I2C2RST_Msk                         /*!< I2C2 block reset Set by software. */
#define RCC_APB1RSTSETR_SPDIFRST_Pos               (26U)
#define RCC_APB1RSTSETR_SPDIFRST_Msk               (0x1UL << RCC_APB1RSTSETR_SPDIFRST_Pos)              /*!< 0x04000000 */
#define RCC_APB1RSTSETR_SPDIFRST                   RCC_APB1RSTSETR_SPDIFRST_Msk                        /*!< SPDIFRX block reset Set by software. */

