zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131axx_ca7.h
/*************  Bit definition for RCC_MP_S_AHB4ENCLRR register  **************/
#define RCC_MP_S_AHB4ENCLRR_GPIOAEN_Pos            (0U)
#define RCC_MP_S_AHB4ENCLRR_GPIOAEN_Msk            (0x1UL << RCC_MP_S_AHB4ENCLRR_GPIOAEN_Pos)           /*!< 0x00000001 */
#define RCC_MP_S_AHB4ENCLRR_GPIOAEN                RCC_MP_S_AHB4ENCLRR_GPIOAEN_Msk                     /*!< GPIOA peripheral clocks enable Cleared by (secure) software. */
#define RCC_MP_S_AHB4ENCLRR_GPIOBEN_Pos            (1U)
#define RCC_MP_S_AHB4ENCLRR_GPIOBEN_Msk            (0x1UL << RCC_MP_S_AHB4ENCLRR_GPIOBEN_Pos)           /*!< 0x00000002 */
#define RCC_MP_S_AHB4ENCLRR_GPIOBEN                RCC_MP_S_AHB4ENCLRR_GPIOBEN_Msk                     /*!< GPIOB peripheral clocks enable Cleared by (secure) software. */
#define RCC_MP_S_AHB4ENCLRR_GPIOCEN_Pos            (2U)
#define RCC_MP_S_AHB4ENCLRR_GPIOCEN_Msk            (0x1UL << RCC_MP_S_AHB4ENCLRR_GPIOCEN_Pos)           /*!< 0x00000004 */
#define RCC_MP_S_AHB4ENCLRR_GPIOCEN                RCC_MP_S_AHB4ENCLRR_GPIOCEN_Msk                     /*!< GPIOC peripheral clocks enable Cleared by (secure) software. */
#define RCC_MP_S_AHB4ENCLRR_GPIODEN_Pos            (3U)
#define RCC_MP_S_AHB4ENCLRR_GPIODEN_Msk            (0x1UL << RCC_MP_S_AHB4ENCLRR_GPIODEN_Pos)           /*!< 0x00000008 */
#define RCC_MP_S_AHB4ENCLRR_GPIODEN                RCC_MP_S_AHB4ENCLRR_GPIODEN_Msk                     /*!< GPIOD peripheral clocks enable Cleared by (secure) software. */
#define RCC_MP_S_AHB4ENCLRR_GPIOEEN_Pos            (4U)
#define RCC_MP_S_AHB4ENCLRR_GPIOEEN_Msk            (0x1UL << RCC_MP_S_AHB4ENCLRR_GPIOEEN_Pos)           /*!< 0x00000010 */
#define RCC_MP_S_AHB4ENCLRR_GPIOEEN                RCC_MP_S_AHB4ENCLRR_GPIOEEN_Msk                     /*!< GPIOE peripheral clocks enable Cleared by (secure) software. */
#define RCC_MP_S_AHB4ENCLRR_GPIOFEN_Pos            (5U)
#define RCC_MP_S_AHB4ENCLRR_GPIOFEN_Msk            (0x1UL << RCC_MP_S_AHB4ENCLRR_GPIOFEN_Pos)           /*!< 0x00000020 */
#define RCC_MP_S_AHB4ENCLRR_GPIOFEN                RCC_MP_S_AHB4ENCLRR_GPIOFEN_Msk                     /*!< GPIOF peripheral clocks enable Cleared by (secure) software. */
#define RCC_MP_S_AHB4ENCLRR_GPIOGEN_Pos            (6U)
#define RCC_MP_S_AHB4ENCLRR_GPIOGEN_Msk            (0x1UL << RCC_MP_S_AHB4ENCLRR_GPIOGEN_Pos)           /*!< 0x00000040 */
#define RCC_MP_S_AHB4ENCLRR_GPIOGEN                RCC_MP_S_AHB4ENCLRR_GPIOGEN_Msk                     /*!< GPIOG peripheral clocks enable Cleared by (secure) software. */
#define RCC_MP_S_AHB4ENCLRR_GPIOHEN_Pos            (7U)
#define RCC_MP_S_AHB4ENCLRR_GPIOHEN_Msk            (0x1UL << RCC_MP_S_AHB4ENCLRR_GPIOHEN_Pos)           /*!< 0x00000080 */
#define RCC_MP_S_AHB4ENCLRR_GPIOHEN                RCC_MP_S_AHB4ENCLRR_GPIOHEN_Msk                     /*!< GPIOH peripheral clocks enable Cleared by (secure) software. */
#define RCC_MP_S_AHB4ENCLRR_GPIOIEN_Pos            (8U)
#define RCC_MP_S_AHB4ENCLRR_GPIOIEN_Msk            (0x1UL << RCC_MP_S_AHB4ENCLRR_GPIOIEN_Pos)           /*!< 0x00000100 */
#define RCC_MP_S_AHB4ENCLRR_GPIOIEN                RCC_MP_S_AHB4ENCLRR_GPIOIEN_Msk                     /*!< GPIOI peripheral clocks enable Cleared by (secure) software. */

/*************  Bit definition for RCC_MP_NS_AHB4ENSETR register  *************/
#define RCC_MP_NS_AHB4ENSETR_GPIOAEN_Pos           (0U)
#define RCC_MP_NS_AHB4ENSETR_GPIOAEN_Msk           (0x1UL << RCC_MP_NS_AHB4ENSETR_GPIOAEN_Pos)          /*!< 0x00000001 */
#define RCC_MP_NS_AHB4ENSETR_GPIOAEN               RCC_MP_NS_AHB4ENSETR_GPIOAEN_Msk                    /*!< GPIOA peripheral clocks enable Set by software. */
#define RCC_MP_NS_AHB4ENSETR_GPIOBEN_Pos           (1U)
#define RCC_MP_NS_AHB4ENSETR_GPIOBEN_Msk           (0x1UL << RCC_MP_NS_AHB4ENSETR_GPIOBEN_Pos)          /*!< 0x00000002 */
#define RCC_MP_NS_AHB4ENSETR_GPIOBEN               RCC_MP_NS_AHB4ENSETR_GPIOBEN_Msk                    /*!< GPIOB peripheral clocks enable Set by software. */
#define RCC_MP_NS_AHB4ENSETR_GPIOCEN_Pos           (2U)
#define RCC_MP_NS_AHB4ENSETR_GPIOCEN_Msk           (0x1UL << RCC_MP_NS_AHB4ENSETR_GPIOCEN_Pos)          /*!< 0x00000004 */
#define RCC_MP_NS_AHB4ENSETR_GPIOCEN               RCC_MP_NS_AHB4ENSETR_GPIOCEN_Msk                    /*!< GPIOC peripheral clocks enable Set by software. */
#define RCC_MP_NS_AHB4ENSETR_GPIODEN_Pos           (3U)
#define RCC_MP_NS_AHB4ENSETR_GPIODEN_Msk           (0x1UL << RCC_MP_NS_AHB4ENSETR_GPIODEN_Pos)          /*!< 0x00000008 */
#define RCC_MP_NS_AHB4ENSETR_GPIODEN               RCC_MP_NS_AHB4ENSETR_GPIODEN_Msk                    /*!< GPIOD peripheral clocks enable Set by software. */
#define RCC_MP_NS_AHB4ENSETR_GPIOEEN_Pos           (4U)
#define RCC_MP_NS_AHB4ENSETR_GPIOEEN_Msk           (0x1UL << RCC_MP_NS_AHB4ENSETR_GPIOEEN_Pos)          /*!< 0x00000010 */
#define RCC_MP_NS_AHB4ENSETR_GPIOEEN               RCC_MP_NS_AHB4ENSETR_GPIOEEN_Msk                    /*!< GPIOE peripheral clocks enable Set by software. */
#define RCC_MP_NS_AHB4ENSETR_GPIOFEN_Pos           (5U)
#define RCC_MP_NS_AHB4ENSETR_GPIOFEN_Msk           (0x1UL << RCC_MP_NS_AHB4ENSETR_GPIOFEN_Pos)          /*!< 0x00000020 */
#define RCC_MP_NS_AHB4ENSETR_GPIOFEN               RCC_MP_NS_AHB4ENSETR_GPIOFEN_Msk                    /*!< GPIOF peripheral clocks enable Set by software. */
#define RCC_MP_NS_AHB4ENSETR_GPIOGEN_Pos           (6U)
#define RCC_MP_NS_AHB4ENSETR_GPIOGEN_Msk           (0x1UL << RCC_MP_NS_AHB4ENSETR_GPIOGEN_Pos)          /*!< 0x00000040 */
#define RCC_MP_NS_AHB4ENSETR_GPIOGEN               RCC_MP_NS_AHB4ENSETR_GPIOGEN_Msk                    /*!< GPIOG peripheral clocks enable Set by software. */
#define RCC_MP_NS_AHB4ENSETR_GPIOHEN_Pos           (7U)
#define RCC_MP_NS_AHB4ENSETR_GPIOHEN_Msk           (0x1UL << RCC_MP_NS_AHB4ENSETR_GPIOHEN_Pos)          /*!< 0x00000080 */
#define RCC_MP_NS_AHB4ENSETR_GPIOHEN               RCC_MP_NS_AHB4ENSETR_GPIOHEN_Msk                    /*!< GPIOH peripheral clocks enable Set by software. */
#define RCC_MP_NS_AHB4ENSETR_GPIOIEN_Pos           (8U)
#define RCC_MP_NS_AHB4ENSETR_GPIOIEN_Msk           (0x1UL << RCC_MP_NS_AHB4ENSETR_GPIOIEN_Pos)          /*!< 0x00000100 */
#define RCC_MP_NS_AHB4ENSETR_GPIOIEN               RCC_MP_NS_AHB4ENSETR_GPIOIEN_Msk                    /*!< GPIOI peripheral clocks enable Set by software. */

/*************  Bit definition for RCC_MP_NS_AHB4ENCLRR register  *************/
#define RCC_MP_NS_AHB4ENCLRR_GPIOAEN_Pos           (0U)
#define RCC_MP_NS_AHB4ENCLRR_GPIOAEN_Msk           (0x1UL << RCC_MP_NS_AHB4ENCLRR_GPIOAEN_Pos)          /*!< 0x00000001 */
#define RCC_MP_NS_AHB4ENCLRR_GPIOAEN               RCC_MP_NS_AHB4ENCLRR_GPIOAEN_Msk                    /*!< GPIOA peripheral clocks enable Cleared by software. */
#define RCC_MP_NS_AHB4ENCLRR_GPIOBEN_Pos           (1U)
#define RCC_MP_NS_AHB4ENCLRR_GPIOBEN_Msk           (0x1UL << RCC_MP_NS_AHB4ENCLRR_GPIOBEN_Pos)          /*!< 0x00000002 */
#define RCC_MP_NS_AHB4ENCLRR_GPIOBEN               RCC_MP_NS_AHB4ENCLRR_GPIOBEN_Msk                    /*!< GPIOB peripheral clocks enable Cleared by software. */
#define RCC_MP_NS_AHB4ENCLRR_GPIOCEN_Pos           (2U)
#define RCC_MP_NS_AHB4ENCLRR_GPIOCEN_Msk           (0x1UL << RCC_MP_NS_AHB4ENCLRR_GPIOCEN_Pos)          /*!< 0x00000004 */
#define RCC_MP_NS_AHB4ENCLRR_GPIOCEN               RCC_MP_NS_AHB4ENCLRR_GPIOCEN_Msk                    /*!< GPIOC peripheral clocks enable Cleared by software. */
#define RCC_MP_NS_AHB4ENCLRR_GPIODEN_Pos           (3U)
#define RCC_MP_NS_AHB4ENCLRR_GPIODEN_Msk           (0x1UL << RCC_MP_NS_AHB4ENCLRR_GPIODEN_Pos)          /*!< 0x00000008 */
#define RCC_MP_NS_AHB4ENCLRR_GPIODEN               RCC_MP_NS_AHB4ENCLRR_GPIODEN_Msk                    /*!< GPIOD peripheral clocks enable Cleared by software. */
#define RCC_MP_NS_AHB4ENCLRR_GPIOEEN_Pos           (4U)
#define RCC_MP_NS_AHB4ENCLRR_GPIOEEN_Msk           (0x1UL << RCC_MP_NS_AHB4ENCLRR_GPIOEEN_Pos)          /*!< 0x00000010 */
#define RCC_MP_NS_AHB4ENCLRR_GPIOEEN               RCC_MP_NS_AHB4ENCLRR_GPIOEEN_Msk                    /*!< GPIOE peripheral clocks enable Cleared by software. */
#define RCC_MP_NS_AHB4ENCLRR_GPIOFEN_Pos           (5U)
#define RCC_MP_NS_AHB4ENCLRR_GPIOFEN_Msk           (0x1UL << RCC_MP_NS_AHB4ENCLRR_GPIOFEN_Pos)          /*!< 0x00000020 */
#define RCC_MP_NS_AHB4ENCLRR_GPIOFEN               RCC_MP_NS_AHB4ENCLRR_GPIOFEN_Msk                    /*!< GPIOF peripheral clocks enable Cleared by software. */
#define RCC_MP_NS_AHB4ENCLRR_GPIOGEN_Pos           (6U)
#define RCC_MP_NS_AHB4ENCLRR_GPIOGEN_Msk           (0x1UL << RCC_MP_NS_AHB4ENCLRR_GPIOGEN_Pos)          /*!< 0x00000040 */
#define RCC_MP_NS_AHB4ENCLRR_GPIOGEN               RCC_MP_NS_AHB4ENCLRR_GPIOGEN_Msk                    /*!< GPIOG peripheral clocks enable Cleared by software. */
#define RCC_MP_NS_AHB4ENCLRR_GPIOHEN_Pos           (7U)
#define RCC_MP_NS_AHB4ENCLRR_GPIOHEN_Msk           (0x1UL << RCC_MP_NS_AHB4ENCLRR_GPIOHEN_Pos)          /*!< 0x00000080 */
#define RCC_MP_NS_AHB4ENCLRR_GPIOHEN               RCC_MP_NS_AHB4ENCLRR_GPIOHEN_Msk                    /*!< GPIOH peripheral clocks enable Cleared by software. */
#define RCC_MP_NS_AHB4ENCLRR_GPIOIEN_Pos           (8U)
#define RCC_MP_NS_AHB4ENCLRR_GPIOIEN_Msk           (0x1UL << RCC_MP_NS_AHB4ENCLRR_GPIOIEN_Pos)          /*!< 0x00000100 */
#define RCC_MP_NS_AHB4ENCLRR_GPIOIEN               RCC_MP_NS_AHB4ENCLRR_GPIOIEN_Msk                    /*!< GPIOI peripheral clocks enable Cleared by software. */

