zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131axx_ca7.h
/******************  Bit definition for SYSCFG_CMPSD2ENCLRR register   ********************/
#define SYSCFG_CMPSD2ENCLRR_EN_Pos                  (0U)
#define SYSCFG_CMPSD2ENCLRR_EN_Msk                  (0x1UL << SYSCFG_CMPSD2ENCLRR_EN_Pos)      /*!< 0x00000001 */
#define SYSCFG_CMPSD2ENCLRR_EN                      SYSCFG_CMPSD2ENCLRR_EN_Msk                /*!< Compensation cell disable */

/******************  Bit definition for SYSCFG_HSLVEN0R register   *************************/
#define SYSCFG_HSLVEN0R_HSLVEN_TRACE_Pos        (0U)
#define SYSCFG_HSLVEN0R_HSLVEN_TRACE_Msk        (0xFFFFUL << SYSCFG_HSLVEN0R_HSLVEN_TRACE_Pos)  /*!< 0x0000FFFF */
#define SYSCFG_HSLVEN0R_HSLVEN_TRACE            SYSCFG_HSLVEN0R_HSLVEN_TRACE_Msk               /*!< HSLVEN[15:0] (High-speed low-voltage I/O mode enable bit field) */

/******************  Bit definition for SYSCFG_HSLVEN1R register   *************************/
#define SYSCFG_HSLVEN1R_HSLVEN_QSPI_Pos         (0U)
#define SYSCFG_HSLVEN1R_HSLVEN_QSPI_Msk         (0xFFFFUL << SYSCFG_HSLVEN1R_HSLVEN_QSPI_Pos)   /*!< 0x0000FFFF */
#define SYSCFG_HSLVEN1R_HSLVEN_QSPI             SYSCFG_HSLVEN1R_HSLVEN_QSPI_Msk                /*!< HSLVEN[15:0] (High-speed low-voltage I/O mode enable bit field) */

/******************  Bit definition for SYSCFG_HSLVEN2R register   *************************/
#define SYSCFG_HSLVEN2R_HSLVEN_ETH1_Pos         (0U)
#define SYSCFG_HSLVEN2R_HSLVEN_ETH1_Msk         (0xFFFFUL << SYSCFG_HSLVEN2R_HSLVEN_ETH1_Pos)   /*!< 0x0000FFFF */
#define SYSCFG_HSLVEN2R_HSLVEN_ETH1             SYSCFG_HSLVEN2R_HSLVEN_ETH1_Msk                /*!< HSLVEN[15:0] (High-speed low-voltage I/O mode enable bit field) */

/******************  Bit definition for SYSCFG_HSLVEN3R register   *************************/
#define SYSCFG_HSLVEN3R_HSLVEN_ETH2_Pos         (0U)
#define SYSCFG_HSLVEN3R_HSLVEN_ETH2_Msk        (0xFFFFUL << SYSCFG_HSLVEN3R_HSLVEN_ETH2_Pos)  /*!< 0x0000FFFF */
#define SYSCFG_HSLVEN3R_HSLVEN_ETH2            SYSCFG_HSLVEN3R_HSLVEN_ETH2_Msk               /*!< HSLVEN[15:0] (High-speed low-voltage I/O mode enable bit field) */

/******************  Bit definition for SYSCFG_HSLVEN4R register   *************************/
#define SYSCFG_HSLVEN4R_HSLVEN_SDMMC1_Pos       (0U)
#define SYSCFG_HSLVEN4R_HSLVEN_SDMMC1_Msk       (0xFFFFUL << SYSCFG_HSLVEN4R_HSLVEN_SDMMC1_Pos) /*!< 0x0000FFFF */
#define SYSCFG_HSLVEN4R_HSLVEN_SDMMC1           SYSCFG_HSLVEN4R_HSLVEN_SDMMC1_Msk              /*!< HSLVEN[15:0] (High-speed low-voltage I/O mode enable bit field) */

/******************  Bit definition for SYSCFG_HSLVEN5R register   *************************/
#define SYSCFG_HSLVEN5R_HSLVEN_SDMMC2_Pos       (0U)
#define SYSCFG_HSLVEN5R_HSLVEN_SDMMC2_Msk       (0xFFFFUL << SYSCFG_HSLVEN5R_HSLVEN_SDMMC2_Pos) /*!< 0x0000FFFF */
#define SYSCFG_HSLVEN5R_HSLVEN_SDMMC2           SYSCFG_HSLVEN5R_HSLVEN_SDMMC2_Msk              /*!< HSLVEN[15:0] (High-speed low-voltage I/O mode enable bit field) */

/******************  Bit definition for SYSCFG_HSLVEN6R register   *************************/
#define SYSCFG_HSLVEN6R_HSLVEN_SPI1_Pos         (0U)
#define SYSCFG_HSLVEN6R_HSLVEN_SPI1_Msk         (0xFFFFUL << SYSCFG_HSLVEN6R_HSLVEN_SPI1_Pos)   /*!< 0x0000FFFF */
#define SYSCFG_HSLVEN6R_HSLVEN_SPI1             SYSCFG_HSLVEN6R_HSLVEN_SPI1_Msk                /*!< HSLVEN[15:0] (High-speed low-voltage I/O mode enable bit field) */

/******************  Bit definition for SYSCFG_HSLVEN7R register   *************************/
#define SYSCFG_HSLVEN7R_HSLVEN_SPI2_Pos         (0U)
#define SYSCFG_HSLVEN7R_HSLVEN_SPI2_Msk         (0xFFFFUL << SYSCFG_HSLVEN7R_HSLVEN_SPI2_Pos)   /*!< 0x0000FFFF */
#define SYSCFG_HSLVEN7R_HSLVEN_SPI2             SYSCFG_HSLVEN7R_HSLVEN_SPI2_Msk                /*!< HSLVEN[15:0] (High-speed low-voltage I/O mode enable bit field) */

/******************  Bit definition for SYSCFG_HSLVEN8R register   *************************/
#define SYSCFG_HSLVEN8R_HSLVEN_SPI3_Pos         (0U)
#define SYSCFG_HSLVEN8R_HSLVEN_SPI3_Msk         (0xFFFFUL << SYSCFG_HSLVEN8R_HSLVEN_SPI3_Pos)   /*!< 0x0000FFFF */
#define SYSCFG_HSLVEN8R_HSLVEN_SPI3             SYSCFG_HSLVEN8R_HSLVEN_SPI3_Msk                /*!< HSLVEN[15:0] (High-speed low-voltage I/O mode enable bit field) */

/******************  Bit definition for SYSCFG_HSLVEN9R register   *************************/
#define SYSCFG_HSLVEN9R_HSLVEN_SPI4_Pos         (0U)
#define SYSCFG_HSLVEN9R_HSLVEN_SPI4_Msk         (0xFFFFUL << SYSCFG_HSLVEN9R_HSLVEN_SPI4_Pos)   /*!< 0x0000FFFF */
#define SYSCFG_HSLVEN9R_HSLVEN_SPI4             SYSCFG_HSLVEN9R_HSLVEN_SPI4_Msk                /*!< HSLVEN[15:0] (High-speed low-voltage I/O mode enable bit field) */

/******************  Bit definition for SYSCFG_HSLVEN10R register   *************************/
#define SYSCFG_HSLVEN10R_HSLVEN_SPI5_Pos        (0U)
#define SYSCFG_HSLVEN10R_HSLVEN_SPI5_Msk        (0xFFFFUL << SYSCFG_HSLVEN10R_HSLVEN_SPI5_Pos)  /*!< 0x0000FFFF */
#define SYSCFG_HSLVEN10R_HSLVEN_SPI5            SYSCFG_HSLVEN10R_HSLVEN_SPI5_Msk               /*!< HSLVEN[15:0] (High-speed low-voltage I/O mode enable bit field) */

/******************  Bit definition for SYSCFG_HSLVEN11R register   *************************/
#define SYSCFG_HSLVEN11R_HSLVEN_LTDC_Pos        (0U)
#define SYSCFG_HSLVEN11R_HSLVEN_LTDC_Msk        (0xFFFFUL << SYSCFG_HSLVEN11R_HSLVEN_LTDC_Pos)  /*!< 0x0000FFFF */
#define SYSCFG_HSLVEN11R_HSLVEN_LTDC            SYSCFG_HSLVEN11R_HSLVEN_LTDC_Msk               /*!< HSLVEN[15:0] (High-speed low-voltage I/O mode enable bit field) */

/**********************  Bit definition for SYSCFG_IDCR register  *****************/
#define SYSCFG_IDCR_DEV_ID_Pos      (0U)
#define SYSCFG_IDCR_DEV_ID_Msk      (0xFFFUL << SYSCFG_IDCR_DEV_ID_Pos)             /*!< 0x00000FFF */
#define SYSCFG_IDCR_DEV_ID          SYSCFG_IDCR_DEV_ID_Msk                         /*!< Device ID number */
#define SYSCFG_IDCR_REV_ID_Pos      (16U)
#define SYSCFG_IDCR_REV_ID_Msk      (0xFFFFUL << SYSCFG_IDCR_REV_ID_Pos)            /*!< 0xFFFF0000 */
#define SYSCFG_IDCR_REV_ID          SYSCFG_IDCR_REV_ID_Msk                         /*!< Device revision number */


